Управление_пожарной_частью_/src/DataProcessors/ЗагрузкаИзExcelВещевоеИмущество/ЗагрузкаИзExcelВещевоеИмущество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаИзExcelВещевоеИмущество</name>
</mdclass:DataProcessor>

Управление_пожарной_частью_/src/Enums/РазмерОдежды/РазмерОдежды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазмерОдежды</name>
  <enumValues>
    <name>_46</name>
  </enumValues>
  <enumValues>
    <name>_47</name>
  </enumValues>
  <enumValues>
    <name>_50</name>
  </enumValues>
  <enumValues>
    <name>_52</name>
  </enumValues>
</mdclass:Enum>

Управление_пожарной_частью_/src/Documents/ВыдачаВещевогоИмущества/ВыдачаВещевогоИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаВещевогоИмущества</name>
  <registerRecords>AccumulationRegister.НоменклатураСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.НоменклатураНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланДатаСписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/СписаниеВещевогоИмущества/СписаниеВещевогоИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеВещевогоИмущества</name>
  <registerRecords>AccumulationRegister.НоменклатураСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.НоменклатураНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/ПоступлениеНаСклад/ПоступлениеНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаСклад</name>
  <registerRecords>AccumulationRegister.НоменклатураНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/DataProcessors/ЗагрузкаИзExcelВещевоеИмущество/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СсылкаНаФайлНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Попытка
		Оповещение = Новый ОписаниеОповещения("ЗагрузкаДанных", ЭтотОбъект);
		НачатьПомещениеФайлаНаСервер(Оповещение,,,,,УникальныйИдентификатор);
		
	Исключение
		ПредупреждениеАсинх("Проверьте не открыт ли файл в другом приложении");
	КонецПопытки;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузкаДанных(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	Если  ОписаниеПомещенногоФайла = Неопределено Тогда
		
		Возврат;	
		
	КонецЕсли;
	СсылкаНаФайл = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.ПолноеИмя;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	Если ПустаяСтрока(СсылкаНаФайл) Тогда
		
		Сообщить ("Укажите путь к файлу");
		Возврат;
		
	КонецЕсли;
	ИмпотрНоменклатуры (СсылкаНаФайл);
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ИмпотрНоменклатуры (ПутьКФайлу)
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		
		ТабДок.Прочитать(ПутьКФайлу);
		
	Исключение
		Сообщить ("Не удалось прочитать файл" + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	КоличествоСоздано = 0;
	
	Для НомерСтроки = 2  По КоличествоСтрок Цикл
		
		Наименование = СокрЛП(ТабДок.Область("R" + НомерСтроки + "C1").Текст);
		СрокИспользования = СокрЛП(ТабДок.Область("R" + НомерСтроки + "C2").Текст);

		Если Справочники.Номенклатура.НайтиПоНаименованию(Наименование) = Справочники.Номенклатура.ПустаяСсылка() Тогда
			НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
			НоваяНоменклатура.Наименование = Наименование; 
			НоваяНоменклатура.СрокИспользования = СрокИспользования;
			
			Попытка
				НоваяНоменклатура.Записать();
				КоличествоСоздано = КоличествоСоздано + 1; 
				
			Исключение
				Сообщить ("Не удалось записать норматив" + ОписаниеОшибки());
				
			КонецПопытки;
		Иначе
			Сообщить ("Номенклатура " + Наименование + " уже существует");
		КонецЕсли;
	КонецЦикла; 
	Если КоличествоСоздано > 0 Тогда
		Сообщить("Создано номенклатур: " + КоличествоСоздано);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыдачуВещевогоОбеспечения(Команда)
	Если ПустаяСтрока(СсылкаНаФайл) Тогда
		
		Сообщить ("Укажите путь к файлу");
		Возврат;
		
	КонецЕсли;
	ИмпортВыдачи (СсылкаНаФайл);
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ИмпортВыдачи(ПутьКФайлу)
	
ТабДок = Новый ТабличныйДокумент;
Попытка
	ТабДок.Прочитать(ПутьКФайлу);
Исключение
	Сообщить("Не удалось прочитать файл: " + ОписаниеОшибки());
	Возврат;
КонецПопытки;

Дата        = СокрЛП(ТабДок.Область("R2C1").Текст);
Организация = СокрЛП(ТабДок.Область("R2C2").Текст);
Склад       = СокрЛП(ТабДок.Область("R2C3").Текст);
Сотрудник   = СокрЛП(ТабДок.Область("R2C4").Текст);
Комментарий = СокрЛП(ТабДок.Область("R2C5").Текст);
Ответственный = СокрЛП(ТабДок.Область("R2C6").Текст);

ДатаДок = ТекущаяДата();
Попытка
	День = Число(Сред(Дата, 1, 2));
	Месяц = Число(Сред(Дата, 4, 2));
	Год = Число(Сред(Дата, 7, 4));
	ДатаДок = Дата(Год, Месяц, День);
Исключение
	Сообщить("Ошибка даты: " + Дата);	
КонецПопытки;

Организация = Справочники.Организации.НайтиПоНаименованию(Организация);
Склад = Справочники.Склады.НайтиПоНаименованию(Склад);
Сотрудник = Справочники.ФизическиеЛица.НайтиПоНаименованию(Сотрудник);
Ответственный = Справочники.ФизическиеЛица.НайтиПоНаименованию(Ответственный);

Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|    ВыдачаВещевогоИмущества.Ссылка
|ИЗ
|    Документ.ВыдачаВещевогоИмущества КАК ВыдачаВещевогоИмущества
|ГДЕ
|    ВыдачаВещевогоИмущества.Дата = &Дата
|    И ВыдачаВещевогоИмущества.Организация = &Организация
|    И ВыдачаВещевогоИмущества.Склад = &Склад
|    И ВыдачаВещевогоИмущества.ФизическоеЛицо = &Сотрудник";

Запрос.УстановитьПараметр("Дата", ДатаДок);
Запрос.УстановитьПараметр("Организация", Организация);
Запрос.УстановитьПараметр("Склад", Склад);
Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();

Если Выборка.Следующий() Тогда
	Сообщить("Документ выдачи вещевого имущества с такими параметрами уже существует!");
	Возврат;
КонецЕсли;

Док = Документы.ВыдачаВещевогоИмущества.СоздатьДокумент();
Док.Дата = ДатаДок;
Док.Организация = Организация;
Док.Склад = Склад;
Док.ФизическоеЛицо = Сотрудник;
Док.Комментарий = Комментарий;
Док.Ответственный = Ответственный;

Док.ВещевоеИмущество.Очистить();

КоличествоСтрок = ТабДок.ВысотаТаблицы;
КоличествоДобавлено = 0;

Для НомерСтроки = 4 По КоличествоСтрок Цикл
	
	Номенклатура = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C1").Текст);
	Размер       = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C2").Текст);
	Количество   = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C3").Текст);
	ДатаСписания = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C4").Текст);

	Если ПустаяСтрока(Номенклатура) Тогда
		Продолжить;
	КонецЕсли;
	
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура);
	Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Сообщить("Номенклатура не найдена: " + Номенклатура);
		Продолжить;
	КонецЕсли;
	
	РазмерПеречисление = Перечисления.РазмерОдежды.ПустаяСсылка();
	Если Размер = "46" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._46;
	ИначеЕсли Размер = "47" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._47;
	ИначеЕсли Размер = "48" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._48;
	ИначеЕсли Размер = "50" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._50;
	ИначеЕсли Размер = "52" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._52;
	ИначеЕсли Размер = "54" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._54;
	ИначеЕсли Размер = "56" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._56;
	КонецЕсли;
	
	КоличествоЧисло = 0;
	Если НЕ ПустаяСтрока(Количество) Тогда
		Попытка
			КоличествоЧисло = Число(Количество);
		Исключение
			КоличествоЧисло = 0;
		КонецПопытки;
	КонецЕсли;
	
	ДатаОконч = ТекущаяДата();
Попытка
	День = Число(Сред(ДатаСписания, 1, 2));
	Месяц = Число(Сред(ДатаСписания, 4, 2));
	Год = Число(Сред(ДатаСписания, 7, 4));
	ДатаОконч = Дата(Год, Месяц, День);
Исключение
	Сообщить("Ошибка даты: " + ДатаСписания);	
КонецПопытки;
	
	// Добавляем строку в табличную часть
	НоваяСтрока = Док.ВещевоеИмущество.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Размер = РазмерПеречисление;
	НоваяСтрока.Количество = КоличествоЧисло;
	НоваяСтрока.ПланДатаСписания = ДатаОконч;
	КоличествоДобавлено = КоличествоДобавлено + 1;
КонецЦикла;

Если КоличествоДобавлено > 0 Тогда
	Попытка
		Док.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Успешно! Документ №" + Док.Номер + 
		         " от " + Формат(ДатаДок, "ДЛФ=Д") + 
		         ", позиций: " + КоличествоДобавлено);
	Исключение
		Сообщить("Ошибка записи документа: " + ОписаниеОшибки());
	КонецПопытки;
КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписаниеИмущества(Команда)
	Если ПустаяСтрока(СсылкаНаФайл) Тогда
		
		Сообщить ("Укажите путь к файлу");
		Возврат;
		
	КонецЕсли;
	ИмпортСписания (СсылкаНаФайл);
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаСервере
Процедура ИмпортСписания(ПутьКФайлу)
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(ПутьКФайлу);
	Исключение
		Сообщить("Не удалось прочитать файл: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Дата        = СокрЛП(ТабДок.Область("R2C1").Текст);
	Организация = СокрЛП(ТабДок.Область("R2C2").Текст);
	Склад       = СокрЛП(ТабДок.Область("R2C3").Текст);
	Сотрудник   = СокрЛП(ТабДок.Область("R2C4").Текст);
	Комментарий = СокрЛП(ТабДок.Область("R2C5").Текст);
	Ответственный = СокрЛП(ТабДок.Область("R2C6").Текст);
	
	ДатаДок = ТекущаяДата();
	Попытка
		День = Число(Сред(Дата, 1, 2));
		Месяц = Число(Сред(Дата, 4, 2));
		Год = Число(Сред(Дата, 7, 4));
		ДатаДок = Дата(Год, Месяц, День);
	Исключение
	Сообщить("Ошибка даты: " + Дата);	
	КонецПопытки;
	
	Организация = Справочники.Организации.НайтиПоНаименованию(Организация);
	Склад = Справочники.Склады.НайтиПоНаименованию(Склад);
	Сотрудник = Справочники.ФизическиеЛица.НайтиПоНаименованию(Сотрудник);
	Ответственный = Справочники.ФизическиеЛица.НайтиПоНаименованию(Ответственный);
	
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщить("Организация не найдена: " + Организация);
		Возврат;
	КонецЕсли;
	
	Если Склад = Справочники.Склады.ПустаяСсылка() Тогда
		Сообщить("Склад не найден: " + Склад);
		Возврат;
	КонецЕсли;
	
	Если Сотрудник = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
		Сообщить("Сотрудник не найден: " + Сотрудник);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|    СписаниеВещевогоИмущества.Ссылка
	|ИЗ
	|    Документ.СписаниеВещевогоИмущества КАК СписаниеВещевогоИмущества
	|ГДЕ
	|    СписаниеВещевогоИмущества.Дата = &Дата
	|    И СписаниеВещевогоИмущества.Организация = &Организация
	|    И СписаниеВещевогоИмущества.Склад = &Склад
	|    И СписаниеВещевогоИмущества.ФизическоеЛицо = &Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
	Сообщить("Документ списания вещевого имущества с такими параметрами уже существует!");
	Возврат;
    КонецЕсли;
		// Создаем новый документ
		Док = Документы.СписаниеВещевогоИмущества.СоздатьДокумент();
		Док.Дата = ДатаДок;
		Док.Организация = Организация;
		Док.Склад = Склад;
		Док.ФизическоеЛицо = Сотрудник;
		Док.Комментарий = Комментарий;
		Док.Ответственный = Ответственный;
		
		Док.ВещевоеИмущество.Очистить();
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	КоличествоДобавлено = 0;
	КоличествоПропущено = 0;
	
	Для НомерСтроки = 4 По КоличествоСтрок Цикл
		
		Номенклатура = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C1").Текст);
		Размер       = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C2").Текст);
		Количество   = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C3").Текст);
		Причина      = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C4").Текст);
		
		Если ПустаяСтрока(Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура);
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Сообщить("Номенклатура не найдена: " + Номенклатура);
			КоличествоПропущено = КоличествоПропущено + 1;
			Продолжить;
		КонецЕсли;
		
		РазмерПеречисление = Перечисления.РазмерОдежды.ПустаяСсылка();
		Если Размер = "46" Тогда
			РазмерПеречисление = Перечисления.РазмерОдежды._46;
		ИначеЕсли Размер = "47" Тогда
			РазмерПеречисление = Перечисления.РазмерОдежды._47;
		ИначеЕсли Размер = "48" Тогда
			РазмерПеречисление = Перечисления.РазмерОдежды._48;
		ИначеЕсли Размер = "50" Тогда
			РазмерПеречисление = Перечисления.РазмерОдежды._50;
		ИначеЕсли Размер = "52" Тогда
			РазмерПеречисление = Перечисления.РазмерОдежды._52;
		ИначеЕсли Размер = "54" Тогда
			РазмерПеречисление = Перечисления.РазмерОдежды._54;
		ИначеЕсли Размер = "56" Тогда
			РазмерПеречисление = Перечисления.РазмерОдежды._56;
		ИначеЕсли Размер = "58" Тогда
			РазмерПеречисление = Перечисления.РазмерОдежды._58;
		ИначеЕсли Размер = "60" Тогда
			РазмерПеречисление = Перечисления.РазмерОдежды._60;
		КонецЕсли;
		
		КоличествоЧисло = 0;
		Если НЕ ПустаяСтрока(Количество) Тогда
			Попытка
				КоличествоЧисло = Число(Количество);
			Исключение
				КоличествоЧисло = 0;
			КонецПопытки;
		КонецЕсли;
		
		СтрокаУжеЕсть = Ложь;
		Для Каждого СтрокаТЧ Из Док.ВещевоеИмущество Цикл
			Если СтрокаТЧ.Номенклатура = Номенклатура 
				И СтрокаТЧ.Размер = РазмерПеречисление Тогда
				СтрокаУжеЕсть = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаУжеЕсть Тогда
			КоличествоПропущено = КоличествоПропущено + 1;
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Док.ВещевоеИмущество.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Размер = РазмерПеречисление;
		НоваяСтрока.Количество = КоличествоЧисло;
		НоваяСтрока.Причина = Причина;
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
	КонецЦикла;
	
	Если КоличествоДобавлено > 0 Тогда
		Попытка
			Док.Записать(РежимЗаписиДокумента.Запись);
			Сообщить("Успешно! Документ №" + Док.Номер + " от " + Формат(ДатаДок, "ДЛФ=Д")); 
		Исключение
			Сообщить("Ошибка записи документа: " + ОписаниеОшибки());
		КонецПопытки;
	Иначе
		Сообщить("Нет новых позиций для добавления. Пропущено: " + КоличествоПропущено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоступлениеИмущества(Команда)
	Если ПустаяСтрока(СсылкаНаФайл) Тогда
		
		Сообщить ("Укажите путь к файлу");
		Возврат;
		
	КонецЕсли;
	ИмпортПоступления (СсылкаНаФайл);
	ОбновитьИнтерфейс();
КонецПроцедуры 
&НаСервере
Процедура ИмпортПоступления(ПутьКФайлу)
	
	ТабДок = Новый ТабличныйДокумент;
Попытка
	ТабДок.Прочитать(ПутьКФайлу);
Исключение
	Сообщить("Не удалось прочитать файл: " + ОписаниеОшибки());
	Возврат;
КонецПопытки;

Дата        = СокрЛП(ТабДок.Область("R2C1").Текст);
Организация = СокрЛП(ТабДок.Область("R2C2").Текст);
Склад       = СокрЛП(ТабДок.Область("R2C3").Текст);
Комментарий = СокрЛП(ТабДок.Область("R2C4").Текст);
Ответственный = СокрЛП(ТабДок.Область("R2C5").Текст);

// Преобразуем дату
ДатаДок = ТекущаяДата();
Попытка
	День = Число(Сред(Дата, 1, 2));
	Месяц = Число(Сред(Дата, 4, 2));
	Год = Число(Сред(Дата, 7, 4));
	ДатаДок = Дата(Год, Месяц, День);
Исключение
	Сообщить("Ошибка даты: " + Дата);	
КонецПопытки;

// Находим ссылки из справочников
Организация = Справочники.Организации.НайтиПоНаименованию(Организация);
Склад = Справочники.Склады.НайтиПоНаименованию(Склад);
Ответственный = Справочники.ФизическиеЛица.НайтиПоНаименованию(Ответственный);

Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|    ПоступлениеНаСклад.Ссылка
|ИЗ
|    Документ.ПоступлениеНаСклад КАК ПоступлениеНаСклад
|ГДЕ
|    ПоступлениеНаСклад.Дата = &Дата
|    И ПоступлениеНаСклад.Организация = &Организация
|    И ПоступлениеНаСклад.Склад = &Склад";

Запрос.УстановитьПараметр("Дата", ДатаДок);
Запрос.УстановитьПараметр("Организация", Организация);
Запрос.УстановитьПараметр("Склад", Склад);

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();

Если Выборка.Следующий() Тогда
	Сообщить("Документ поступления на склад с такими параметрами уже существует!");
	Возврат;
КонецЕсли;

// ===== СОЗДАЁМ ДОКУМЕНТ =====
Док = Документы.ПоступлениеНаСклад.СоздатьДокумент();
Док.Дата = ДатаДок;
Док.Организация = Организация;
Док.Склад = Склад;
Док.Комментарий = Комментарий;
Док.Ответственный = Ответственный;

// Очищаем табличную часть
Док.ВещевоеИмущество.Очистить();

КоличествоСтрок = ТабДок.ВысотаТаблицы;
КоличествоДобавлено = 0;

Для НомерСтроки = 4 По КоличествоСтрок Цикл
	
	Номенклатура = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C1").Текст);
	Размер       = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C2").Текст);
	Количество   = СокрЛП(ТабДок.Область("R" + Формат(НомерСтроки, "ЧГ=0") + "C3").Текст);
	
	// Пропускаем пустые строки
	Если ПустаяСтрока(Номенклатура) Тогда
		Продолжить;
	КонецЕсли;
	
	// Находим номенклатуру
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура);
	Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Сообщить("Номенклатура не найдена: " + Номенклатура);
		Продолжить;
	КонецЕсли;
	
	// Преобразуем размер в перечисление
	РазмерПеречисление = Перечисления.РазмерОдежды.ПустаяСсылка();
	Если Размер = "46" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._46;
	ИначеЕсли Размер = "47" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._47;
	ИначеЕсли Размер = "48" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._48;
	ИначеЕсли Размер = "50" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._50;
	ИначеЕсли Размер = "52" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._52;
	ИначеЕсли Размер = "54" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._54;
	ИначеЕсли Размер = "56" Тогда
		РазмерПеречисление = Перечисления.РазмерОдежды._56;
	КонецЕсли;
	
	// Преобразуем количество в число
	КоличествоЧисло = 0;
	Если НЕ ПустаяСтрока(Количество) Тогда
		Попытка
			КоличествоЧисло = Число(Количество);
		Исключение
			КоличествоЧисло = 0;
		КонецПопытки;
	КонецЕсли;
	
	// Добавляем строку в табличную часть
	НоваяСтрока = Док.ВещевоеИмущество.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Размер = РазмерПеречисление;
	НоваяСтрока.Количество = КоличествоЧисло;
	
	КоличествоДобавлено = КоличествоДобавлено + 1;
	
КонецЦикла;

// Записываем документ
Если КоличествоДобавлено > 0 Тогда
	Попытка
		Док.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Успешно! Документ №" + Док.Номер + 
		         " от " + Формат(ДатаДок, "ДЛФ=Д") + 
		         ", позиций: " + КоличествоДобавлено);
	Исключение
		Сообщить("Ошибка записи документа: " + ОписаниеОшибки());
	КонецПопытки;
Иначе
	Сообщить("Нет данных для заполнения");
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСклады(Команда)
	Если ПустаяСтрока(СсылкаНаФайл) Тогда
		
		Сообщить ("Укажите путь к файлу");
		Возврат;
		
	КонецЕсли;
	ИмпортСкладов (СсылкаНаФайл);
	ОбновитьИнтерфейс();
КонецПроцедуры
&НаСервере
Процедура ИмпортСкладов(ПутьКФайлу)

ТабДок = Новый ТабличныйДокумент;
	Попытка
		
		ТабДок.Прочитать(ПутьКФайлу);
		
	Исключение
		Сообщить ("Не удалось прочитать файл" + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	КоличествоСоздано = 0;
	
	Для НомерСтроки = 2  По КоличествоСтрок Цикл
		
		Наименование = СокрЛП(ТабДок.Область("R" + НомерСтроки + "C1").Текст);
		Владелец =  СокрЛП(ТабДок.Область("R" + НомерСтроки + "C2").Текст);
		
		Если Справочники.Склады.НайтиПоНаименованию(Наименование) = Справочники.Склады.ПустаяСсылка() Тогда
			НовыйСклад = Справочники.Склады.СоздатьЭлемент();
			НовыйСклад.Наименование = Наименование;
			Владелец = Справочники.Организации.НайтиПоНаименованию(Владелец);
			НовыйСклад.Владелец = Владелец;
			
			Попытка
				НовыйСклад.Записать();
				КоличествоСоздано = КоличествоСоздано + 1; 
				
			Исключение
				Сообщить ("Не удалось записать склад" + ОписаниеОшибки());
				
			КонецПопытки;
		Иначе
			Сообщить (Наименование + " уже существует");
		КонецЕсли;
	КонецЦикла; 
	Если КоличествоСоздано > 0 Тогда
		Сообщить("Создано складов: " + КоличествоСоздано);
	КонецЕсли;	

КонецПроцедуры
